Revit 2027 API
ImageInstance.Height Property
 The height of the ImageInstance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Height { get; set; }
Public Property Height As Double
	Get
	Set
public:
property double Height {
	double get ();
	void set (double value);
}
member Height : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The given value for height results in a width that is more than 30000 feet because LockProportions is set to true.
ArgumentOutOfRangeException |  When setting this property: The given value for height must be between 0 and 30000 feet.
Remarks
 If LockProportions is true, then changes to the Height will also result in changes to the Width.
See Also
Reference
ImageInstance Class
Autodesk.Revit.DB Namespace